000100  IDENTIFICATION DIVISION.                                        ID73-80X
000200  PROGRAM-ID. AUDITLOG.                                           ID73-80X
000300  DATA DIVISION.                                                  ID73-80X
000400  COPY CUSTREC.                                                   ID73-80X
000500  PROCEDURE DIVISION.                                             ID73-80X
000600  LOG-PARA.                                                       ID73-80X
000700      GOBACK.                                                     ID73-80X
