000100  IDENTIFICATION DIVISION.                                        ID73-80X
000200  PROGRAM-ID. CUSTRPT.                                            ID73-80X
000300  PROCEDURE DIVISION.                                             ID73-80X
000400  RPT-PARA.                                                       ID73-80X
000500      GOBACK.                                                     ID73-80X
