//NIGHTLY  JOB (ACCT),'BATCH',CLASS=A,
//             MSGCLASS=X
//* comment line must be ignored
//UPDATE   EXEC PGM=CUSTUPD
//CUSTIN   DD DSN=PROD.CUST.MASTER,DISP=SHR
//         DD DSN=PROD.CUST.MASTER.G0001V00,DISP=SHR
//CUSTOUT  DD DSN=PROD.CUST.MASTER.NEW,
//             DISP=(NEW,CATLG,DELETE)
//REPORT   EXEC CUSTRPTP
//SYSIN    DD *
  IN-STREAM DATA MUST NOT PARSE AS JCL
/*
